# Задача 4-Напишите программу, которая по заданному номеру 
# четверти, показывает диапазон возможных координат точек в этой 
# четверти (x и y).
# Пример:
# - quarter = 1 => x∈(0, ∞) u y∈(0,∞)

a = int(input("Введите номер четверти:  "))

if   a == 1: print(" Для плоскости четверти 1: x от 0 до + ∞, y от 0 до + ∞") 
elif a == 2: print(" Для плоскости четверти 1: x от 0 до  - ∞, y от 0  до + ∞ ")  
elif a == 3: print(" Для плоскости четверти 1: x от 0 до  - ∞, y от 0  до - ∞ ")
elif a == 4: print(" Для плоскости четверти 1: x от 0 до  + ∞, y от 0  до - ∞ ")
else:        print("Ошибка! Проверьте условия и повторите ввод!") 