# Задача 3 - Дан массив размера N. После каждого отрицательного 
# элемента массива вставьте элемент с нулевым значением.
# Пример:
# - пусть N = 4, тогда [28, -46, 14, -14] => [28, -46, 0, 14, -14, 0]

import random # берем рандом
num = int (input('Введите число размера массива: ')) # вводим массив
numbers = []
for i in range(num): 
    numbers.append(random.randint(-9,10))# добавляем рандомное значение
print(f'Исходный массив {numbers}') # выводим массив
i = 0
for n in numbers: # пока n внутри массива
    i += 1 # позиция элемента и добавляем 1
    if n < 0:
        numbers.insert(i, 0)# проходим по всему массиву
print(f'Новый массив: {numbers}')
