# 1 - Задайте натуральное число N. Напишите программу, которая 
# составит список простых множителей числа N.
# N = 20 -> [2,5]
# N = 30 -> [2, 3, 5]

num = int(input("Введите число: "))
i = 2 
lst = []
old = num
while i <= num:
    if num % i == 0:
        lst.append(i)
        num //= i
        i = 2
    else:
        i += 1
print(f"Простые множители числа {old} выведены в список: {lst}")

# При выводе множетелей 20 не могу понять как устранить повторяющуюся 2,
# как и при выводе 8 или 16, то есть повторяющиеся