# colors = ['red', 'green', 'blue'] # набор данных в качетсве списка
# data = open('file.txt', 'a')# создаем текстовую переменную data 
# # и связываем ее с текстовым файлом указывая путь к файлу 'file.txt' 
# # и мод дозаписи'a' любое кол-во раз, w перезапишет заново
# # data.writelines(colors) # записываем данные в качестве аргумента разделителей не будет
# data.write('\nLine2\n') # запись с переносом строк с помошью \n
# data.write('Line3\n') # запись с переносом строк с помошью \n
# data.close #закрываем файл чтобы не было утечек памяти
# exit() # позволяет не выполнять написанное ниже


#                или такой вариант вноса данных
# with open('file.txt', 'w') as data:
#     data.write('Line2\n') # запись с переносом строк с помошью \n
#     data.write('Line3\n')
# закрытие файла в данном случае произойдет автоматически

#                       ЧТЕНИЕ ФАЙЛОВ
# path = 'file.txt' # путь к папке
# data = open(path, 'r') # открываем в режиме чтения
# for line in data: # считаем строки в цикле
#     print(line) #
# data.close() # закроем


        # ИЗ ОДНОГО ФАЙЛА ИСПОЛЬЗУЕМ ФУНКЦИОНАЛ ДРУГОГО
# Берем из lec1.py  с 232 строки
import lec1
print(lec1.f(1)) # импортируем все что только хотим

# ИЛИ
# import lec1 as l # вводим сокрашение и прописываем при распечатке
# print(l.f(1))