#Задача 4-Напишите программу, которая будет принимать на вход 
# дробь и показывать первую цифру дробной части числа.

# *Примеры:* 

# - 6.78 -> 7
# - 5 -> нет
# - 0.34 -> 3

# num = input('Введите дробное число: ')#запрашиваем ввод дробного числа в строке
# numbers = num.split('.')#сплитом отделяем через точку из дробного числа
# num = numbers[1]#список 
# print(num[0])#печатаем первый элемент дробного числа

# или

num = input('Введите дробное число: ')#запрашиваем ввод дробного числа в строке
numbers = num.split('.')#сплитом отделяем через точку из дробного числа
if len(numbers) == 1:
    print('нет')
else:
    num = numbers[1]#список 
print(num[0])#печатаем первый элемент дробного числа


