# 2. Напишите программу, которая определит позицию второго 
# вхождения строки в списке либо сообщит, что её нет.
# Пример:
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

new_list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
find = 'qwe'
def func(new_list, find):
    count = 0
    n = -1
    for i in range(0, len(new_list)): # в цикле от 0 до конца списка
        a = new_list[i] == find
        if a:
            count+=1
        if count == 2:
            return i
    return n
print(func(new_list, find))