#Задача 2. Напишите программу, которая на вход принимает 5 чисел и 
# находит максимальное из них.

#Примеры:

# - 1, 4, 8, 7, 5 -> 8
# - 78, 55, 36, 90, 2 -> 90

numbers = input('Введите через пробел 5 чисел: ')
numbers = numbers.split(' ') #превращаем строку в список используя разделитель пробел
maximum = int(numbers[0])#берем первое и парралельно превращаем в число
print(numbers)# чтобы увидеть что список из строк
for i in numbers:
    i = int(i) #каждый элемент превращаем в число
    if maximum < i:
        maximum = i
print(maximum)