# Задача 1 Напишите программу, которая принимает на вход число N,
# и выдает последовательность из N членов
# Пример: Для N = 5: 1, -3, 9, -27, 81

num = int(input('Введите число: '))#Строку 32 превращаем в число 32 благодаря int
res = 1 # переменную счетчик вводим
for i in range(1, num + 1): # или (0, num) Для i находящуюся в диапазоне N то есть от (1 до 5)
    print(res, end =' ') #  end =' ' это чтобы в строку через запятую
    res *= -3 #сокращенное от res = res * -3

# второй вариант это возведение в степень -3
# for i in range(int(imput()))
#   print((-3)**i, end = ' ')