# Написать программу, в которой пользователь будет задавать две
# строки а программа определять количество вхождений строки одной в другую
# Привет Мир Привет друг
# Привет
# Ответ 2 так как привет встречается 2 раза в первый раз

str1 = input('Первая строка: ')
str2 = input('Вторая строка: ')
count = 0
str1 = str1.split() # разбиваем строку на слова для удобства поиска, так как вторая строка это 1 слово
for i in str1:
    if i == str2:
        count +=1 # увеличиваем на 1
print(count)